import sys
import os

BASE_DIR = os.path.dirname(os.path.dirname(os.path.abspath(__file__)))
sys.path.append(BASE_DIR)

from sqlalchemy.orm import Session
from sqlalchemy import select
from bot.db import engine
from bot.db.models import CardType

PEOPLE = [
    ("Екатерина","Наймушина","2 курс\nИнформационные системы и технологии"),
    ("Лаврентий","Харитонов","2 курс\nПрограммная инженерия"),
    ("Елена","Беляева","2 курс\nПрикладная информатика"),
    ("Марк","Соколов","3 курс\nПрикладная информатика"),
    ("Михаил","Ламбрехт","3 курс\nПрограммная инженерерия"),
    ("Павел","Шихирин","2 курс\nПрикладная информатика"),
    ("Полина","Шинкевич","2 курс\nИнформационные системы и технологии"),
    ("Профком","ГУАП","Самая масштабная и крутая организация в ГУАП"),
    ("Руфина","Шарипова","4 курс\nИнформационные системы и технологии"),
    ("Софья","Комолова","4 курс\nПрикладная информатика"),
    ("Артём","Ледовских","3 курс\nПрикладная информатика"),
    ("Тимофей","Кошев","3 курс\nПрикладная информатика"),
    ("Алеся","Лопаткова","4 курс\nИнформационные системы и технологии"),
    ("Алла","Гончаренко","2 курс\nПрикладная информатика"),
    ("Владислав","Горбунов","3 курс\nИнформатика и вычислительная техника"),
    ("Георгий","Максимов","2 курс\nИнформационные системы и технологии"),
    ("Данил","Бычков","3 курс\nИнформационные системы и технологии"),
    ("Денис","Кольцов","3 курс\nПрикладная информатика"),
    ("Дмитрий","Матвеев","2 курс\nИнформационные системы и технологии"),
    ("Илья","Полозков","3 курс\nИнформационные системы и технологии"),
    ("Денис","Федоров","Председатель ППОСА ГУАП"),
]

def run():
    created, updated = 0, 0
    with Session(engine) as db:
        for first, last, desc in PEOPLE:
            ct = db.execute(
                select(CardType).where(
                    (CardType.first_name == first) & (CardType.last_name == last)
                )
            ).scalar_one_or_none()
            if ct is None:
                ct = CardType(first_name=first, last_name=last, description=desc)
                db.add(ct)
                created += 1
            else:
                ct.description = desc
                updated += 1
        db.commit()
    print(f"Done. Created: {created}, updated: {updated}")

if __name__ == "__main__":
    run()
